# -*- coding: utf-8 -*-
import numpy as np
import pandas as pd
balance_index = ['აქტივები','ძირითადი საშუალებები','არამატერიალური აქტივები','საინვესტიციო ქონება','ინვესტიციები შვილობილ კომპანიებში',
'გადავადებული საგადასახადო აქტივი','საბანკო დეპოზიტები','გაცემული სესხები','გადაზღვევის აქტივები','სადაზღვეო მოთხოვნები','გადავადებული აკვიზიციური ხარჯები',
'სხვა აქტივები','ფული და ფულის ეკვივალენტები',' ','სულ აქტივები',' ','საკუთარი კაპიტალი','ჩვეულებრივი აქციები','საემისიო კაპიტალი','ძირითადი საშუალებების გადაფასების რეზერვი',
'გაუნაწილებელი მოგება',' ','სულ საკუთარი კაპიტალი',' ','ვალდებულებები','სადაზღვეო ხელშეკრულების ვალდებულებები','სადაზღვეო პრემიის რეზერვები','სანაზღაურებელი ზარალებია',
'დაზღვევის და გადაზღვევის ვალდებულებები','საინვესტიციო ხელშეკრულების ვალდებულებები','სავაჭრო და სხვა ვალდებულებები','გადავადებული საგადასახადო ვალდებულება',' ',
'სულ ვალდებულებები',' ','სულ საკუთარი კაპიტალი და ვალდებულებები']
balance_list_2018 = [' ',3646,1532,155,11080,'-',20208,1065,17626,36942,5630,17062,5646,' ',120592,' ',' ',27550,126,2234,19214,' ',49124,' ','-','-',38977,19249,4449,3274,5496,23,' ',71468,' ',120592]
balance_list_2017 = [' ',1486,1429,155,12768,134,20073,492,17634,34767,5062,14841,6412,' ',115253,' ',' ',17288,126,'-',18206,' ',35620,' ','-','-',37788,21766,8039,5982,6058,'-',' ',79633,' ',115253]
balance_2017 = pd.Series(balance_list_2017,index = balance_index)
balance_2018 = pd.Series(balance_list_2018,index = balance_index)
balance_statement = pd.DataFrame({'2017':balance_2017,'2018':balance_2018},columns = ['2017','2018'])
#print (balance_statement)
icnome_index = ['შემოსავლები','მოზიდული პრემია, ბრუტო','გამოკლებული: გადამზღვევლის კუთვნილი პრემია','მოზიდული პრემია, ნეტო','გამოუმუშავებელი პრემიის რეზერვის ცვლილება, ნეტო',
                ' ','გამომუშავებული პრემია, ნეტო',' ','საკომისიო შემოსავალი გადაზღვევიდან','საინვესტიციო და სხვა შემოსავალი',' ','სულ შემოსავალი',' ','ხარჯები','ანაზღაურებული სადაზღვეო ზარალები, ბრუტო',
                'გადამზღვევლის წილი ანაზღაურებულ სადაზღვეო ზარალებში','ცვლილება სადაზღვეო ზარალების რეზერვში','გადაზღვევის წილი სადაზღვეო ზარალების რეზერვების ცვლილებაში',
                'სადაზღვეო ზარალები, ნეტო',' ','საპროცენტო ხარჯი','პირდაპირი აკვიზიციის და სადაზღვეო საკომისიო ხარჯი','სხვა აკვიზიციური ხარჯები','სხვა საოპერაციო და ადმინისტრაციუილ ხარჯები',
                'სხვა საოპერაციო და ადმინისტრაციული ხარჯები','სულ ხარჯები',' ','მოგება დაბეგვრამდე',' ','მოგების გადასახადის ხარჯი',' ','წლის წმინდა მოგება',' ','სხვა სრული შემოსავალი',
                'ნაშთები, რომლებს რეკლასიფიცირება არ მოხდება მოგება-ზარალში',' ','ძირითადი საშუალებების გადაფასება',' ','სხვა სრული შემოსავალი წლის განმავლობაში','სრული შემოსავალი წლის განმავლობაში']
income_list_2018 = [' ',103931,-17443,86488,-1172,' ',85316,' ',4148,3201,' ',92665,' ',' ',-77186,9603,2517,-25,-65091,' ',-263,-2445,-14009,568,-5317,-86557,' ',6108,' ',-838,' ',5270,' ',' ',' ',' ',2234,' ',
                    2234,7504]
income_list_2017 = [' ',98904,-19580,79324,901,' ',80225,' ',4945,4069,' ',89239,' ',' ',-62175,4967,-10389,6609,-60988,' ',-248,-1339,-13453,-2243,-4274,-82545,' ',
                    6694,' ',-1682,' ',5012,' ',' ',' ',' ',0,' ',0,5012]
income_2017 = pd.Series(data = income_list_2017,index=icnome_index)
income_2018 = pd.Series(data = income_list_2018,index=icnome_index)
income_statment = pd.DataFrame({'2017':income_2017,'2018':income_2018},columns = ['2017','2018'])
#print (income_statment)

cash_flow_index = ['ფულადი ნაკადები საოპერაციო საქმიანობიდან','წლის წმინდა მოგება',' ','კორექტირებები:','ცვეთა და ამორტიზაცია','ზარალი ინვესტიციის რეალიზაციიდან','მოგება საინვესტიციო ქონების და ძირითადი საშუალებების რეალიზაციიდან',
                   'საპროცენტო შემოსავალი','საპროცენტო ხარჯი','მოგების გადასახადის ხარჯი','ცვლილება გადავადებულ აკვიზიციურ ხარჯში',' ','ცვლილებები საოპერაციო აქტივებსა და ვალდებულებებში',
                   'ცვლილება პრემიის რეზერვებში, ნეტო (გადამზღვევლის წილის გარეშე)','ცვლილება ასანაზღაურებელ ზარალებში, ნეტო (გადამზღვევლის წილის გარეშე)','ცვლილება სადაზღვეო მოთხოვნებში',
                   'ცვლილება სხვა აქტივებში','ცვლილება დაზღვევის, გადაზღვევის, \n სავაჭრო და სხვა ვალდებულებებსა და \nსაინვესტიციო კონტრაქტების ვალდებულებებში','ცვლილებები საბანკო დეპოზიტებში',' ','გადახდილი მოგების გადასახადი',
                   'მიღებული პროცენტი','წმინდა ფულადი ნაკადები საოპერაციო საქმიანობიდან',' ','ფულადი ნაკადები საინვესტიციო საქმიანობიდან','ძირითადი საშუალებების და არამატერიალური აქტივების ნეტო შეძენა',
                   'სესხების გაცემა','სასესხო მოთხოვნის დაფარვა','შემოსავალი საინვესტიციო ქონების რეალიზაციიდან','შემოსავალი ინვესტიციის რეალიზაციიდან','საინვესტიციო საქმიანობებში გამოყენებული წმინდა ფულადი ნაკადები',
                   ' ','ფულადი ნაკადები ფინანსური საქმიანობებიდან','კაპიტალის ზრდა','ფინანსურ საქმიანობებში გამოყენებული წმინდა ფულადი ნაკადები',' ','ფულის და ფულის ეკვივალენტების ზრდა/კლება',
                   'ფულის და ფულის ეკვივალენტები წლის დასაწყისში','ფულის და ფულის ეკვივალენტები წლის ბოლოს']

cash_flow_list_2017 = [' ',5270,' ',' ',683,688,48,-1473,263,838,-568,5749,' ',1172,-2492,-2175,-587,-7187,-168,-5688,-1654,1303,-6039,' ',' ',-758,-1356,987,'-',1000,-127,' ',' ',5400,5400,' ',-766,6412,5646]
cash_flow_list_2018 = [' ',5012,' ',' ',648,'-','-',-1710,248,1682,2243,8123,' ',-901,3780,305,-2701,-6226,-4045,-1665,-1754,1983,-1436,' ',' ',-714,-539,783,716,'-',246,' ',' ','-','-',' ',-1190,7602,6412]
cash_flow_2017 = pd.Series(cash_flow_list_2017,index=cash_flow_index)
cash_flow_2018 = pd.Series(cash_flow_list_2018,index=cash_flow_index)

cash_flow_statement = pd.DataFrame({'2017':cash_flow_2017,'2018':cash_flow_2018},columns=['2017','2018'])
























